Question 1

In [2]:
import pandas as pd
print(pd.__version__)

1.0.5

Question 2

In [3]:
import numpy as np

In [9]:
data=np.array(['a','b','c','d'])
data
s=pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

Question 3

In [12]:
jk = pd.DataFrame({'Roll No':['B1','B2','B3','B4','B5'],'Name':['Ram','sam','Rosh','Jiya','Dev'],'Grade':['A','C','B','D','E']})
jk

  Roll No  Name Grade
0      B1   Ram     A
1      B2   sam     C
2      B3  Rosh     B
3      B4  Jiya     D
4      B5   Dev     E

Question 4

In [2]:
import seaborn as sp
tips = sp.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [11]:
data = sp.load_dataset('mpg')
data.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

Question 5

In [12]:
data['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

Question 6

In [13]:

print(pd.DataFrame(data[data['origin']=='usa']))

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
0    18.0          8         307.0       130.0    3504          12.0
1    15.0          8         350.0       165.0    3693          11.5
2    18.0          8         318.0       150.0    3436          11.0
3    16.0          8         304.0       150.0    3433          12.0
4    17.0          8         302.0       140.0    3449          10.5
..    ...        ...           ...         ...     ...           ...
392  27.0          4         151.0        90.0    2950          17.3
393  27.0          4         140.0        86.0    2790          15.6
395  32.0          4         135.0        84.0    2295          11.6
396  28.0          4         120.0        79.0    2625          18.6
397  31.0          4         119.0        82.0    2720          19.4

     model_year origin                       name
0            70    usa  chevrolet chevelle malibu
1            70    usa          buick skylark 320
2            70    usa         plymouth satellite
3            70    usa              amc rebel sst
4            70    usa                ford torino
..          ...    ...                        ...
392          82    usa           chevrolet camaro
393          82    usa            ford mustang gl
395          82    usa              dodge rampage
396          82    usa                ford ranger
397          82    usa                 chevy s-10

[249 rows x 9 columns]